app/controllers/modulo_cliente_controller.rb

SELECT  "clientes".* FROM "clientes" WHERE "clientes"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "personas".* FROM "personas" WHERE "personas"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "direccions".* FROM "direccions" WHERE "direccions"."persona_id" = ? LIMIT 1  [["persona_id", 1]]
SELECT  "telefonos".* FROM "telefonos" WHERE "telefonos"."persona_id" = ? LIMIT 1  [["persona_id", 1]]
SELECT  "fisicas".* FROM "fisicas" WHERE "fisicas"."persona_id" = ? LIMIT 1  [["persona_id", 1]]
SELECT  "portafolios".* FROM "portafolios" WHERE "portafolios"."cliente_id" = ? LIMIT 1  [["cliente_id", 1]]
SELECT  "hojas".* FROM "hojas" WHERE "hojas"."portafolio_id" = ? LIMIT 1  [["portafolio_id", 1]]
SELECT "proyectos".* FROM "proyectos" WHERE "proyectos"."hoja_id" = ?  [["hoja_id", 1]]
---
  def modulo_cliente

  	#@cliente = Cliente.find(params[:id])
  	@cliente = {nombreEmp: "", ubicacion: "", contacto: "", email: "", telefono:""}
  	#@listaProyectos = Proyecto.find(@cliente.proyectos)
  	#@listaProyectos = [{id: 0, nombre: "Proyecto Contabilidad", razon: "Contabilidad", tiempo: "6 meses", administrador: "Francisco C", costo: "$4000"}, {id: 1, nombre: "Proyecto Secreto", razon: "Facturacion", tiempo: "2 meses", administrador: "Juan Ruiz", costo: "$1000"}, {id: 2, nombre: "Proyecto 3 Impresion", razon: "Impresion de Facturas", tiempo: "2 semanas", administrador: "Carlos López C", costo: "$800"}]

    #cargar el cliente buscado en la lista de clientes
    if params[:idCliente]
      cliente = Cliente.find_by(id: params[:idCliente])
      persona = Persona.find_by(id: cliente[:persona_id])
      direccion = Direccion.find_by(persona_id: cliente[:persona_id])
      telefono = Telefono.find_by(persona_id: cliente[:persona_id])

      if persona[:tipoPersona] = 'f'
        fisica = Fisica.find_by(persona_id: cliente[:persona_id])
         @cliente = {id: cliente[:id], nombreEmp: cliente[:nombreEmp], ubicacion: direccion[:pais]+", "+direccion[:provincia]+", "+direccion[:ciudad], contacto: fisica[:nombre], email: persona[:email], telefono: telefono[:numero]}
      else
        juridica = Juridica.find_by(persona_id: cliente[:persona_id])
         @cliente = {id: cliente[:id], nombreEmp: cliente[:nombreEmp], ubicacion: direccion[:pais]+", "+direccion[:provincia]+", "+direccion[:ciudad], contacto: juridica[:razonSocial], email: persona[:email], telefono: telefono[:numero]}
     end
      #telefono = telefonos[1]


      portafolio = Portafolio.find_by(cliente_id: params[:idCliente])
      hoja = Hoja.find_by(portafolio_id: portafolio[:id])
      proyectos = Proyecto.where(hoja_id: hoja[:id])

SELECT "clientes".* FROM "clientes" WHERE (nombreEmp LIKE '%Vai%')
SELECT "clientes".* FROM "clientes"
SELECT  "personas".* FROM "personas" WHERE "personas"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "direccions".* FROM "direccions" WHERE "direccions"."persona_id" = ? LIMIT 1  [["persona_id", 1]]
SELECT  "telefonos".* FROM "telefonos" WHERE "telefonos"."persona_id" = ? LIMIT 1  [["persona_id", 1]]
SELECT  "fisicas".* FROM "fisicas" WHERE "fisicas"."persona_id" = ? LIMIT 1  [["persona_id", 1]]
---
   def lista_clientes

  #comprobar primero si viene directamente de una busqueda
  if params[:buscarCliente]
    @clienteABuscar = params[:buscarCliente][:cliente].to_s
    #puts "Cliente a buscar : " + @clienteABuscar
    listaDeClientes = Cliente.where("nombreEmp LIKE ?", "%#{@clienteABuscar}%")
    puts listaDeClientes
  else
    listaDeClientes = Cliente.all

  end

  @clientes = []
  listaDeClientes.each do |cliente|
    persona = Persona.find_by(id: cliente[:persona_id])
    direccion = Direccion.find_by(persona_id: cliente[:persona_id])
    telefono = Telefono.find_by(persona_id: cliente[:persona_id])

     if persona[:tipoPersona] = 'f'
        fisica = Fisica.find_by(persona_id: cliente[:persona_id])

SELECT  "clientes".* FROM "clientes" WHERE "clientes"."id" = ? LIMIT 1  [["id", 1]]
---

  if params[:idCliente]
    @telefonos = ""
    cliente = Cliente.find_by(id: params[:idCliente])