app/controllers/recursos_controller.rb

SELECT "recursos".* FROM "recursos"
---
  def lista_recursos
  	@recursos = []
  	@recursos.push({id: 1, nombreEmp: "Ruby Code" , ubicacion: "Guadalupe", contacto: "Ing. Adolfo", correo: "jpabloruiz@gmail.com", telefono:"2511-8547"})

  	#comprobar primero si viene directamente de una busqueda
  if params[:buscarRecurso]
    @recursoABuscar = params[:buscarRecursoc][:cliente].to_s
    #puts "Cliente a buscar : " + @clienteABuscar
    habilidades = Habilidad.where("descripcion LIKE ?", "%#{@recursoABuscar}%")
    listaDeRecursos = []
	habilidades.each do |habilidad|
    	listaDeRecursos.push(Recurso.find_by(id: habilidad[:recurso_id]))
    end
    puts listaDeRecursos
  else
    listaDeRecursos = Recurso.all