app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."usuario" = ? LIMIT 1  [["usuario", "pj045"]]
---
def create
    if user = User.from_omniauth(env["omniauth.auth"])
      session[:user_id] = user.id
      redirect_to root_url
    elsif  user = User.find_by(usuario: params[:session][:usuario].to_s.downcase)